In [1]:
### Importing libraries

In [10]:
import pandas as pd
from IPython.display import display

In [26]:
data = pd.DataFrame({"Name": ['Cecelia', 'Osire', 'Ebere','Shilla'],
                     "Department": ["HR", "IT", "LG", "Eng"],
                     "Age": [88,31,51,84]})
display(data)

      Name Department  Age
0  Cecelia         HR   88
1    Osire         IT   31
2    Ebere         LG   51
3   Shilla        Eng   84

In [27]:
def divide(row):
        result = row['Age']/10
        return result

data['age_divided'] = data.apply(divide, axis=1)

data

      Name Department  Age  age_divided
0  Cecelia         HR   88          8.8
1    Osire         IT   31          3.1
2    Ebere         LG   51          5.1
3   Shilla        Eng   84          8.4

In [28]:
divide_2 = lambda x: x/10
divide_2(data['Age'])

0    8.8
1    3.1
2    5.1
3    8.4
Name: Age, dtype: float64

In [29]:
data['age_2'] = divide_2(data['Age'])

data

      Name Department  Age  age_divided  age_2
0  Cecelia         HR   88          8.8    8.8
1    Osire         IT   31          3.1    3.1
2    Ebere         LG   51          5.1    5.1
3   Shilla        Eng   84          8.4    8.4

In [30]:
data['age_3'] = data['Age'].apply(lambda x: x/10)

data

      Name Department  Age  age_divided  age_2  age_3
0  Cecelia         HR   88          8.8    8.8    8.8
1    Osire         IT   31          3.1    3.1    3.1
2    Ebere         LG   51          5.1    5.1    5.1
3   Shilla        Eng   84          8.4    8.4    8.4

In [31]:
data['age_label'] = data['Age'].apply(
       lambda x: 'very old' if x > 55 else ('middle-aged' if x >=40 else 'young'))

data

      Name Department  Age  age_divided  age_2  age_3    age_label
0  Cecelia         HR   88          8.8    8.8    8.8     very old
1    Osire         IT   31          3.1    3.1    3.1        young
2    Ebere         LG   51          5.1    5.1    5.1  middle-aged
3   Shilla        Eng   84          8.4    8.4    8.4     very old

In [ ]:
conda activate venv_20th_century 
cd C:\Webdrivers\chromedriver.exe